In [ ]:
import pandas as pd

In [2]:
my_data = {
    'cars' : ['Toyota', 'Honda', 'Ford', 'BMW'],
    'price' : [24000, 22000, 26000, 35000]
}

# create a DataFrame
df_cars = pd.DataFrame(my_data)

In [6]:
df_cars.head()

     cars  price
0  Toyota  24000
1   Honda  22000
2    Ford  26000
3     BMW  35000

In [9]:
a = ['Honda', 'Toyota', 'Ford', 'BMW']
sr = pd.Series(a)
print(sr)

0     Honda
1    Toyota
2      Ford
3       BMW
dtype: object

In [7]:
print(df_cars.loc[1])

cars     Honda
price    22000
Name: 1, dtype: object

In [8]:
print(df_cars.loc[[1, 3]])

    cars  price
1  Honda  22000
3    BMW  35000

In [10]:
print(sr[1])

Toyota

In [11]:
my_data = {
    'cars' : ['Toyota', 'Honda', 'Ford', 'BMW'],
    'price' : [24000, 22000, 26000, 35000]
}

df_cars = pd.DataFrame(my_data, index=['CAR01', 'CAR02', 'CAR03', 'CAR04'])
df_cars.head()

         cars  price
CAR01  Toyota  24000
CAR02   Honda  22000
CAR03    Ford  26000
CAR04     BMW  35000

In [14]:
print(df_cars.loc['CAR03'])
print(df_cars.loc[['CAR03', 'CAR01']])

cars      Ford
price    26000
Name: CAR03, dtype: object
         cars  price
CAR03    Ford  26000
CAR01  Toyota  24000

In [15]:
df_training = pd.read_csv('datab10.csv')
df_training.head()

   Duration  Pulse  Maxpulse  Calories
0      60.0  110.0     130.0     409.1
1      60.0  117.0     145.0     479.0
2      60.0  103.0     135.0     340.0
3      45.0  109.0     175.0     282.4
4      45.0    NaN     148.0     406.0

In [17]:
print(list(df_training.columns))

['Duration', 'Pulse', 'Maxpulse', 'Calories']

In [18]:
print(df_training.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 172 entries, 0 to 171
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  170 non-null    float64
 1   Pulse     171 non-null    float64
 2   Maxpulse  171 non-null    float64
 3   Calories  167 non-null    float64
dtypes: float64(4)
memory usage: 5.5 KB
None

In [19]:
print(df_training.describe())

        Duration       Pulse    Maxpulse     Calories
count  170.00000  171.000000  171.000000   167.000000
mean    64.00000  107.508772  134.321637   375.304192
std     42.15918   14.447214   16.401813   264.009282
min     15.00000   80.000000  100.000000    50.300000
25%     45.00000  100.000000  124.000000   252.150000
50%     60.00000  105.000000  131.000000   320.400000
75%     60.00000  111.000000  143.000000   385.800000
max    300.00000  159.000000  184.000000  1860.400000

In [20]:
print(df_training.isnull().sum())

Duration    2
Pulse       1
Maxpulse    1
Calories    5
dtype: int64

In [21]:
df_training_cleaned = df_training.dropna()
print(df_training_cleaned.isnull().sum())

Duration    0
Pulse       0
Maxpulse    0
Calories    0
dtype: int64

In [22]:
print(len(df_training), len(df_training_cleaned))

172 163

In [23]:
# drop only NA rows for Calories column
df_training_cleaned = df_training.dropna(subset=['Calories'])
print(df_training_cleaned.isnull().sum())
print(len(df_training), len(df_training_cleaned))

Duration    2
Pulse       1
Maxpulse    1
Calories    0
dtype: int64
172 167

In [26]:
df_training = pd.read_csv('datab10.csv')
df_training_cleaned = df_training.fillna(0, inplace=False)
print(df_training_cleaned.isnull().sum())

Duration    0
Pulse       0
Maxpulse    0
Calories    0
dtype: int64

In [27]:
print(df_training.isnull().sum())

Duration    2
Pulse       1
Maxpulse    1
Calories    5
dtype: int64

In [28]:
df_training.describe()

        Duration       Pulse    Maxpulse     Calories
count  170.00000  171.000000  171.000000   167.000000
mean    64.00000  107.508772  134.321637   375.304192
std     42.15918   14.447214   16.401813   264.009282
min     15.00000   80.000000  100.000000    50.300000
25%     45.00000  100.000000  124.000000   252.150000
50%     60.00000  105.000000  131.000000   320.400000
75%     60.00000  111.000000  143.000000   385.800000
max    300.00000  159.000000  184.000000  1860.400000

In [29]:
duration_mean = df_training['Duration'].mean()
print("Mean Duration:", duration_mean)

Mean Duration: 64.0

In [33]:
df_training_cleaned = df_training.copy()
df_training_cleaned['Duration'].fillna(duration_mean, inplace=True)
print(df_training_cleaned.isnull().sum())

Duration    0
Pulse       1
Maxpulse    1
Calories    5
dtype: int64

/var/folders/10/3dssf0p51vzgb7zfm9xl0vrm0000gn/T/ipykernel_57348/4119614399.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_training_cleaned['Duration'].fillna(duration_mean, inplace=True)

In [32]:
print(df_training_cleaned['Duration'].mean())

64.0

In [34]:
min_calories = df_training['Calories'].min()
print("Min Calories:", min_calories)

Min Calories: 50.3

In [43]:
df_training_cleaned = df_training.copy()
df_training_cleaned['Calories'].fillna(min_calories, inplace=True)
print(df_training_cleaned.isnull().sum())

Duration    2
Pulse       1
Maxpulse    1
Calories    0
dtype: int64

/var/folders/10/3dssf0p51vzgb7zfm9xl0vrm0000gn/T/ipykernel_57348/1620190135.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_training_cleaned['Calories'].fillna(min_calories, inplace=True)

In [44]:
print(df_training_cleaned['Calories'].mean())

365.8563953488372

In [45]:
df_departments = pd.DataFrame({
    'Department': ['Sales', 'HR', 'Sales', 'HR', 'Sales'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Salary': [70000, 60000, 72000, 58000, 71000]
})

In [46]:
df_departments.head()

  Department Employee  Salary
0      Sales    Alice   70000
1         HR      Bob   60000
2      Sales  Charlie   72000
3         HR    David   58000
4      Sales      Eva   71000

In [47]:
mean_salary = df_departments.groupby('Department')['Salary'].mean()
print(mean_salary)

Department
HR       59000.0
Sales    71000.0
Name: Salary, dtype: float64

In [48]:
employee_count = df_departments.groupby('Department')['Employee'].count()
print(employee_count)

Department
HR       2
Sales    3
Name: Employee, dtype: int64

In [49]:
min_salary = df_departments.groupby('Department')['Salary'].min()
print(min_salary)

Department
HR       58000
Sales    70000
Name: Salary, dtype: int64

In [50]:
df_training = pd.read_csv('datab10.csv')
df_training.head()

   Duration  Pulse  Maxpulse  Calories
0      60.0  110.0     130.0     409.1
1      60.0  117.0     145.0     479.0
2      60.0  103.0     135.0     340.0
3      45.0  109.0     175.0     282.4
4      45.0    NaN     148.0     406.0

In [51]:
print(df_training['Duration'].unique())

[ 60.  45.  30.  80.  20. 210. 160.  nan 180. 150. 300.  90. 120. 270.
  15.  25.  75.]

In [52]:
df_training_cleaned = df_training.fillna({
    'Duration': df_training['Duration'].mean(),
    'Calories': df_training['Calories'].mean(),
    'Pulse': df_training['Pulse'].mean(),
    'Maxpulse': df_training['Maxpulse'].mean()
})

In [53]:
print(df_training_cleaned.groupby('Duration').mean())

               Pulse    Maxpulse     Calories
Duration
15.0      102.000000  119.500000    87.350000
20.0      125.000000  146.000000   151.600000
25.0      152.000000  168.000000   244.200000
30.0      109.812500  137.000000   192.125000
45.0      106.897317  133.000000   277.247305
60.0      106.187500  133.354020   341.062657
64.0      113.500000  134.000000   361.500000
75.0      121.666667  150.000000   323.733333
80.0      123.000000  146.000000   643.100000
90.0       93.750000  116.375000   541.800000
120.0     100.000000  139.000000   666.833333
150.0     101.500000  130.250000   939.400000
160.0     109.500000  136.000000   943.700000
180.0      93.666667  125.666667   733.600000
210.0     122.500000  172.000000  1618.200000
270.0     100.000000  131.000000  1729.000000
300.0     108.000000  143.000000  1500.200000

In [57]:
my_data = {
    'cars' : ['Toyota', 'Honda', 'Ford', 'BMW'],
    'price' : [24000, 22000, 26000, 35000]
}

df_cars = pd.DataFrame(my_data, index=['CAR01', 'CAR02', 'CAR03', 'CAR04'])
df_cars.head()

         cars  price
CAR01  Toyota  24000
CAR02   Honda  22000
CAR03    Ford  26000
CAR04     BMW  35000

In [58]:
df_cars['used'] = [True, False, True, False]
df_cars.head()

         cars  price   used
CAR01  Toyota  24000   True
CAR02   Honda  22000  False
CAR03    Ford  26000   True
CAR04     BMW  35000  False

In [65]:
def strength(duration):
    return 'Strong' if duration >= 60 else 'Weak'

In [ ]:
df_training['Strength'] = df_training['Duration'].apply(strength)
df_training.head(20)

In [67]:
df_training['Strength'] = df_training['Duration'].apply(lambda duration: 'Strong' if duration >= 60 else 'Weak')
df_training.head(20)

    Duration  Pulse  Maxpulse  Calories Strength
0       60.0  110.0     130.0     409.1   Strong
1       60.0  117.0     145.0     479.0   Strong
2       60.0  103.0     135.0     340.0   Strong
3       45.0  109.0     175.0     282.4     Weak
4       45.0    NaN     148.0     406.0     Weak
5       60.0  102.0     127.0     300.0   Strong
6       60.0  110.0     136.0     374.0   Strong
7       45.0  104.0     134.0     253.3     Weak
8       30.0  109.0     133.0     195.1     Weak
9       60.0   98.0     124.0     269.0   Strong
10      60.0  103.0     147.0     329.3   Strong
11      60.0  100.0     120.0     250.7   Strong
12      60.0  106.0     128.0     345.3   Strong
13      60.0  104.0     132.0     379.3   Strong
14      60.0   98.0     123.0     275.0   Strong
15      60.0   98.0     120.0     215.2   Strong
16      60.0  100.0     120.0     300.0   Strong
17      45.0   90.0     112.0       NaN     Weak
18      60.0  103.0     123.0     323.0   Strong
19      45.0   97.0     125.0     243.0     Weak

In [68]:
def my_max(a, b):
    return a if a > b else b

In [69]:
my_max = lambda a, b: a if a > b else b
print(my_max(10, 20))

20